i3
git
curl
feh
i3blocks
rofi
dunst
fonts-font-awesome
fonts-firacode
python3
python3-pip
scrot
imagemagick
vim
libncurses-dev
libgdbm-dev
flex
bison
build-essential
ninja-build 
gettext 
cmake 
unzip
ripgrep